Revit 2027 API
TaskDialog.WasVerificationChecked Method
 Gets the status of the verification checkbox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WasVerificationChecked()
Public Function WasVerificationChecked As Boolean
public:
bool WasVerificationChecked()
member WasVerificationChecked : unit -> bool
Return Value
Boolean
 Whether the verification checkbox is checked.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the task dialog does not have verification checkbox or the task dialog is not shown yet.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace